<?php
    
?>
<!DOCTYPE html>
<html>
<head>
    <title>За Нас - SBank</title>
    <link rel="stylesheet" href="style.css">
    <link rel="stylesheet" href="navbar.css">
</head>
<body>
    <nav id="nav_guests">
        <a class="nav-link" href="index.php">SBank</a>
        <a class="nav-link active" href="about.php">За нас</a></div>
        <div class="container-cart">
        <a class="nav-icon" href="signin_admin.php"><img src="images/admin.png" alt="Влез като собсвеник" width="35px" height = "35px"></a>
    </nav>

    <div class="container-info">
            <h1 class="heading">За SBank</h1>
        <section class="about-section">
            <h2>Кои сме ние</h2>
            <p>Ние сме доверен партньор във финансовия свят, посветен на това да предоставяме модерни, сигурни и персонализирани решения за управление на вашите финанси. С дългогодишен опит и екип от висококвалифицирани професионалисти, ние изграждаме стабилни и дългосрочни отношения с нашите клиенти, базирани на прозрачност, почтеност и уважение.</p>
            
            <h2>Нашата визия</h2>
            <p>Нашата основна цел е да подпомагаме индивидуалните и бизнес клиенти в постигането на техните финансови цели. Ние се стремим да:
            <li>Осигуряваме финансови решения, съобразени с нуждите на всеки клиент.</li>
            <li>Поддържаме високи стандарти за качество и сигурност във всички наши услуги.</li>
            <li>Инвестираме в иновации, които правят банковото обслужване по-достъпно и удобно.</li>
            <li>Поддържаме устойчиво развитие и социална отговорност в нашата дейност.</li></p>

            <h2>Защо да изберете нас</h2>
            <p>ние предлагаме сигурност и доверие, като използваме най-високите стандарти за защита на вашите данни и средства. Подхождаме индивидуално към всеки клиент, предлагайки персонализирани решения, съобразени с вашите нужди и цели. Инвестираме в иновативни технологии, които правят управлението на вашите финанси лесно, бързо и достъпно, независимо къде се намирате. Нашият екип от експерти е винаги готов да ви предостави професионално консултиране и подкрепа, за да вземете правилните финансови решения. Съчетаваме удобството на широка мрежа от офиси и дигитални услуги, за да бъдем до вас по всяко време. Доверете се на нас и изградете стабилно финансово бъдеще с партньор, на когото можете да разчитате.</p>
        </section>
    </div>

    <footer>
            <p>&copy; 2025 Sbank. Всички права запазени.</p>
    </footer>
</body>
</html>
