use PBD;


-- Вмъкване в Client
INSERT INTO Client(name_client, egn, phone_client, adress) VALUES
('Цвета Маргаритова Наталиева','0125478963','0896352417', 'Гр Варна, ул. Дубровник бл18 ап 4'),
('Янислав Иванов Димитнов','6385412930','0887414523', 'Гр Варна, ж.к. Владислав Варненчик бл 247 ап 7'),
('Пламена Радомирова Найденова','7741288963','0887414752', 'Гр Силистра, ул. Капина Кръстев бл.30 ап 31'),
('Тодор Кристиянов Мирчев','0034582551','0877471256','Гр Плевен, ж.к. Сторгозия бл. 2  вх В ап 52'),
('Мария Преславова Илиева','2589314784','0883636525','Гр Созопол, ул. Ропотамо бл. 5 ап 2'),
('Галина Александрова Мариславова','3698989571','0887414716', 'Гр Варна, ж.к. Младос бл 38 ап 8'),
('Вилян Георгиев Георгиев','3362525814','0889658225','Гр София, ул. Христо Смирненски бл. 12 ап 13'),
('Тонислав Станимиров Йорданов','3698798145','0874741212','Гр Варна, ул. Мир бл. 177 ап 3'),
('Анна Павлова Юлисвавова','3632589104','0899878965','Гр Варна, ул. Тополи бл. 49 ап 14'),
('Борис Ивайлов Янакиев','3698952473','0985412586','Гр Варна, бул. Сливница бл.87 ап 6'),
('Иван Борисов Тодоров','0245874694','01212','гр. София, ул. Евлогий Георгиев'),
('Ева Петрова Георжиева','9914578156','01213','гр. София ул. Стефан Стамбулов'),
('Христо Иванов Аврамов','0147894784','01214','гр. София ул. Крум Бъчваров');

-- Вмъкване във Currency
INSERT INTO Currency(currency) VALUES
('BGN'), ('USD'), ('EUR'), ('RUB'), ('GBP');

-- Вмъкване в Account 
INSERT INTO Account(number_account, id_client, interest, availability_amount, id_currency) VALUES
('14702580258749',1, 3.5, 634.08,1),
('36521785400597',1, 5.0, 17895.36,2),
('39517001453995',2, 4.9, 25850.90,2),
('33778545896592',3, 2.8, 300.87,3),
('74785965412500',4, 4.7, 87541.98,1),
('36395824700145',5, 3.2, 784.59,1),
('25874026958742',5, 3.2, 879.30,1),
('14741258745962',6, 3.8, 14787.93,2),
('36251478547962',7, 4.8, 3699.70,1),
('02358741478545',8, 6.9, 252.70,5),
('32365987458742',9, 2.8, 66.58,2),
('36985214741258',10, 2.9, 10.20,1),
('98547856325007',10, 3.1, 10800.50,2),
('98745785126550',10, 3.2, 369.20,1),
('36565989658881',10, 3.8, 987.90,4),
('14752145805871',11, NULL, 1000000000000000,1),
('36985214785214',12, NULL, 100587014,1),
('36985258963258',13, NULL, 10414025870025,1);

-- Вмъкване в Position
INSERT INTO [Position](position_type) VALUES
('Мениджър отдел Банкови операции'),
('Консултант-продажби в отдел Банкиране на дребно'),
('Консултант-продажби в отдел Банково застраховане'),
('Консултант-продажби в отдел Жилищно кредитиране'),
('Консултант-продажби в отдел Стоково кредитиране'),
('Спициалист в отдел Банкови операции'),
('Главен експерт в отдел Връзки с обществеността'),
('Специалист в одел Банкиране на дребно'),
('Управител');

-- Вмъкване в TransactionType
INSERT INTO TransactionType(type, coeff_transaction_client) VALUES
('Теглене на пари в брой от банкомат или ПОС терминал', -1),
('Плащане на стоки и услуги по Интернет', -1),
('Превод на заплата, наем, др.', 1),
('Плащане на вноска по кредит', -1),
('Плащане на вноска по ипотека', -1),
('Прехвърляне на сума към клентска сметка', -1),
('Превод на сума от клентска сметка', 1);

-- Вмъкване в Employee
INSERT INTO Employee(name_employee, phone_employee, id_position) VALUES
('Илиан Владимиров Кунчев','089741523',1),
('Катерина Даниелова Стелкова','087632541',8),
('Дияна Маринова Цветонова','087632550',7),
('Габриела Георгиева Иванова','089785471',6),
('Стоян Атанасов Руменов','089896587',4),
('Мартина Стефанова Начева','088965874',3),
('Румен Борянов Ненчев','089365478',2),
('Глория Ганева Спасова','087478552',2),
('Петко Илиянов Стоянов','088710012',5),
('Тихомир Лъчезар Петкавов','089574130',5),
('Петя Денева Христинова','087471203',1),
('Сияна Аврамова','0884074514',9);

-- Вмъкване в TRANSACTION_STATES
INSERT INTO TRANSACTION_STATES(type_status) VALUES
('Одобрена'), ('Отхвърлена'), ('Изчаква одобрение');

-- Вмъкване в Transaction 
INSERT INTO [Transaction] (id_account, id_type, amount, id_account_affected, date_transaction, id_status) VALUES
(1,6,200,101,'2023-10-23',1),
(2,7,50,107,'2023-10-22',2),
(9,5,1000,116,'2023-10-22',1),
(12,4,854.41,115,'2023-10-13',3),
(13,7,635.25,108,'2023-10-21',1),
(7,2,258.20,117,'2023-10-19',1),
(8,2,982.8,117,'2023-10-12',2),
(6,3,147.02,116,'2023-09-27',3),
(3,3,900.30,116,'2023-09-08',1),
(4,4,1470.20,115,'2023-10-03',1),
(5,5,3693.80,115,'2023-10-16',2),
(2,7,147.20,107,'2023-10-20',1),
(1,2,9652.02,117,'2023-09-18',3),
(11,2,1478.05,117,'2023-09-18',1),
(13,1,639.74,107,'2023-09-01',2);


-- Вмъкване в Logins
INSERT INTO Logins(USERNAME, PASSWORD, id_employee) VALUES
('Sisa', '0000', 12);



